Тест/Тест/src/Catalogs/Машины/Машины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Машины</name>
  <basedOn>Document.ФиксацияЗаказаМашин</basedOn>
  <attributes>
    <name>ВинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>EnumRef.Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.ТипТС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>CatalogRef.МодельТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказаниеОдометраНаНачалоЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <type>
      <types>EnumRef.ТипМашинНаРазборке</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>EnumRef.ТипыКабин</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателя</name>
    <type>
      <types>CatalogRef.МоделиДвигателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливнаяСистема</name>
    <type>
      <types>EnumRef.ТопливнаяСистема</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>CatalogRef.КПП</types>
    </type>
  </attributes>
  <attributes>
    <name>Редуктор</name>
    <type>
      <types>CatalogRef.Редукторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Серии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументФиксацииЗаказаМашины</name>
    <type>
      <types>DocumentRef.ФиксацияЗаказаМашин</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинаАгрегат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/Машины/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПолучитьФункциональнуюОпцию("дт_ИспользоватьГрузоперевозки") Тогда
		ПроверяемыеРеквизиты.Добавить("МаркаТС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	ГосНомер = ВРЕГ(ГосНомер);	
	//Мазин ---------------
	ИмяТекПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	ЗаказчикСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ИмяТекПользователя); 
	//Мазин----------------
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	///+ГомзМА 29.09.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ФиксацияЗаказаМашин") Тогда
		ДокументФиксацииЗаказаМашины = ДанныеЗаполнения.Ссылка;
	КонецЕсли
	///-ГомзМА 29.09.2023
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
